#ifndef INITIAL_MAP_H
#define INITIAL_MAP_H

#include <QMainWindow>

class initial_Map : public QMainWindow
{
    Q_OBJECT
public:
    explicit initial_Map(QWidget *parent = 0);
    /*初始地图数组，
     * 0-空地，
     * 1-3为怪（血量依次设置为60,90,120（暂定）,若走到司令部则分别造成20,40,60的伤害），行动路线可以装到一个数组里（先设置一个关卡）
     * 4-6为士兵（士兵有三种，
     * 4号设置为初级，攻击力初始值为10（范围10-30），攻击范围padding=1，购买价格设为10；
     * 5号设置为中级，攻击力初始值为20（范围20-60），攻击范围padding=2,购买价格设为20；
     * 6号设置为最高级，攻击力设为30（30-90），攻击范围padding=1，购买价格为30），
     * -1为墙，
     * -“force”是士兵所在范围的攻击值（范围暂定为-10-（-100）），
     * 100表示司令部即每购买一个士兵都从这里生成动画,同时100也是司令部的初始生命值
     *

*/
int map[13][13] = {{ 0, 0,-1,-1,-1, 0, 0, 0,-1,-1,-1, 0, 0},
                   { 0, 0,-1,-1,-1, 0, 0, 0,-1,-1,-1, 0, 0},
                   { 0, 0,-1,-1,-1, 0, 0, 0,-1,-1,-1, 0, 0},
                   { 0, 0,-1,-1,-1, 0, 0, 0,-1,-1,-1, 0, 0},
                   { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                   { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                   {-1,-1, 0, 0, 0,-1,-1,-1, 0, 0, 0,-1,-1},
                   {-1,-1, 0, 0, 0,-1,-1,-1, 0, 0, 0,-1,-1},
                   {-1,-1, 0, 0, 0,-1,-1,-1, 0, 0, 0,-1,-1},\
                   {-1,-1, 0, 0, 0,-1,-1,-1, 0, 0, 0,-1,-1},
                   { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                   { 0, 0, 0, 0, 0, 0,100,0, 0, 0, 0, 0, 0},
                   { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0}};

signals:

public slots:
};

#endif // INITIAL_MAP_H
